VUGenSkripts/US3_Buying_Product/result1/Iteration5/t24.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886567890123456</ns2:cardNumber><ns2:expirationDate>072028</ns2:expirationDate><ns2:cvvNumber>115</ns2:cvvNumber><ns2:customerName>sherlock</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>